https://github.com/gregsexton/SICP-Clojure

http://mitpress.mit.edu/sites/default/files/sicp/index.html

1. 前面都在讲什么是计算（声明式与指令式的关系、过程、Y算子、形式语义）、怎么做计算（迭代、递归）、数理逻辑跟计算直接的关系（逻辑式程序设计），
2. 然后最后再用不可计算引出“停机问题”，
3. 再用halt一语双关，指出课程结束。
项目主页：https://github.com/DeathKing/Learning-SICP
信息整合：https://learningsicp.github.io
Racket FAQ：https://racket-zh.org/faq
Racket编程指南: https://blog.csdn.net/chinazhangyong/article/details/79331809
**** 1.3.2 Constructing Procedures Using Lambda
:PROPERTIES:
:ID:       ad97756a-d9f1-4272-b953-7d517feb4234
:END:


#+BEGIN_SRC scheme
  (define (sum term a next b)
      (if (> a b)
          0
          (+ (term a)
              (sum term (next a) next b))))

; racket状态下 初始文件有效
;    (define (inc n) (+ n 1))

;    (define (cube x) (* x x x))

    (define (sum-cubes a b)
      (sum cube a inc b))

    (sum-cubes 1 10)
#+END_SRC

#+RESULTS:
: 3025


***** test2


geiser-racket-init-file

#+NAME: Integral
#+BEGIN_SRC scheme 
      (define (sum term a next b)
        (if (> a b)
            0
            (+ (term a)
               (sum term (next a) next b))))

      (define (pi-sum a b)
        (sum (lambda (x) (/ 1.0 (* x (+ x 2))))
             a
             (lambda (x) (+ x 4))
             b))



      (define (integral f a b dx)
        (* (sum f
                (+ a (/ dx 2.0))
                (lambda (x) (+ x dx))
                b)
           dx))

    (define (square x) (* x x))


  ;  ((lambda (x y z) (+ x y (square z))) 1 2 3)

      (define (f x y)
        (define a (+ 1 (* x y)))
        (define b (- 1 y))
        (+ (* x (square a))
           (* y b)
           (* a b)))

      (f 5 6)

#+END_SRC

#+RESULTS: Integral
: 4620


***** factorial test

#+NAME: factorial
#+BEGIN_SRC scheme
  (factorial 4)
#+END_SRC

#+RESULTS: factorial
: 24


